; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v1 ?v3)
             (pred_7 ?v7 ?v9)
             (pred_8 ?v1 ?v9)
             (pred_4 ?v13 ?v1 )
	     (pred_10 ?v1)
             (pred_11 ?v11)
             (pred_9 ?v7)
             (pred_3 ?v9)
             (pred_12 ?v1)
             (pred_5 ?v7)
             (pred_2 ?v1)
             (pred_1 ))



(:action op_3
:parameters (?v4 ?v12 ?v10 ?v8)
:precondition (and (pred_11 ?v4) (pred_11 ?v12) (pred_9 ?v10) (pred_3 ?v8)
          (pred_6 ?v4 ?v12) (pred_7 ?v10 ?v8)
                   (pred_8 ?v12 ?v8) (pred_10 ?v4) 
                   (pred_12 ?v12) (pred_5 ?v10))
:effect (and  (pred_2 ?v12) (not (pred_12 ?v12))))


(:action op_2
:parameters (?v4 ?v5)
:precondition (and (pred_11 ?v4) (pred_11 ?v5)
               (pred_10 ?v4) (pred_6 ?v4 ?v5) (pred_2 ?v5))
:effect (and (pred_10 ?v5) (not (pred_10 ?v4))))

(:action op_5
:parameters (?v4 ?v10)
:precondition (and (pred_11 ?v4) (pred_9 ?v10) 
                  (pred_10 ?v4) (pred_4 ?v10 ?v4) (pred_1 ))
:effect (and (pred_5 ?v10)
   (not (pred_4 ?v10 ?v4)) (not (pred_1 ))))


(:action op_4
:parameters (?v4 ?v6 ?v2)
:precondition (and (pred_11 ?v4) (pred_9 ?v6) (pred_9 ?v2)
                  (pred_10 ?v4) (pred_5 ?v2) (pred_4 ?v6 ?v4))
:effect (and (pred_5 ?v6) (pred_4 ?v2 ?v4)
        (not (pred_5 ?v2)) (not (pred_4 ?v6 ?v4))))

(:action op_1
:parameters (?v4 ?v10)
:precondition (and (pred_11 ?v4) (pred_9 ?v10) 
                  (pred_10 ?v4) (pred_5 ?v10))
:effect (and (pred_1 ) (pred_4 ?v10 ?v4) (not (pred_5 ?v10)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_04 obj_02 obj_10 obj_06 obj_01 obj_13 obj_03 obj_08 obj_07
    obj_09 obj_05
    obj_12 obj_11
    )

    (:init
       (pred_1)

       (pred_11 obj_04)
       (pred_11 obj_02)
       (pred_11 obj_10)
       (pred_11 obj_06)
       (pred_11 obj_01)
       (pred_11 obj_13)
       (pred_11 obj_03)
       (pred_11 obj_08)
       (pred_11 obj_07)
       (pred_3 obj_09)
       (pred_3 obj_05)
       (pred_9 obj_12)
       (pred_9 obj_11)

       (pred_6 obj_04 obj_06)
       (pred_6 obj_04 obj_02)
       (pred_6 obj_02 obj_01)
       (pred_6 obj_02 obj_10)
       (pred_6 obj_02 obj_04)
       (pred_6 obj_10 obj_13)
       (pred_6 obj_10 obj_02)
       (pred_6 obj_06 obj_03)
       (pred_6 obj_06 obj_01)
       (pred_6 obj_06 obj_04)
       (pred_6 obj_01 obj_08)
       (pred_6 obj_01 obj_13)
       (pred_6 obj_01 obj_02)
       (pred_6 obj_01 obj_06)
       (pred_6 obj_13 obj_07)
       (pred_6 obj_13 obj_10)
       (pred_6 obj_13 obj_01)
       (pred_6 obj_03 obj_08)
       (pred_6 obj_03 obj_06)
       (pred_6 obj_08 obj_07)
       (pred_6 obj_08 obj_01)
       (pred_6 obj_08 obj_03)
       (pred_6 obj_07 obj_13)
       (pred_6 obj_07 obj_08)
       (pred_12 obj_13)
       (pred_12 obj_10)
       (pred_8  obj_13 obj_09)
       (pred_8  obj_10 obj_05)
       (pred_2 obj_04)
       (pred_2 obj_02)
       (pred_2 obj_06)
       (pred_2 obj_01)
       (pred_2 obj_03)
       (pred_2 obj_08)
       (pred_2 obj_07)

       (pred_7  obj_12 obj_09)
       (pred_7  obj_11 obj_05)
       (pred_4 obj_12 obj_02)
       (pred_4 obj_11 obj_08)
       (pred_10 obj_03)
    )

    (:goal (and
       (pred_4 obj_12 obj_07)
    ))
(:constraints
  (always (not (pred_10 obj_01)))
)
)

; plan
1. (op_2 obj_03 obj_06)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_06)
   goals met: 0 of 1
2. (op_2 obj_06 obj_04)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_04)
   goals met: 0 of 1
3. (op_2 obj_04 obj_02)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_02)
   goals met: 0 of 1
4. (op_5 obj_02 obj_12)
   deleted: (pred_4 obj_12 obj_02) (pred_1)
   added: (pred_5 obj_12)
   goals met: 0 of 1
5. (op_2 obj_02 obj_04)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_04)
   goals met: 0 of 1
6. (op_2 obj_04 obj_06)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_06)
   goals met: 0 of 1
7. (op_2 obj_06 obj_03)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_03)
   goals met: 0 of 1
8. (op_2 obj_03 obj_08)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_08)
   goals met: 0 of 1
9. (op_2 obj_08 obj_07)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_07)
   goals met: 0 of 1
10. (op_1 obj_07 obj_12)
   deleted: (pred_5 obj_12)
   added: (pred_1) (pred_4 obj_12 obj_07)
   goals met: 1 of 1
